Revit 2026 API

# YZJustificationOption Enumeration

---

The option for whether a framing element has independent or uniform justification on its ends.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum YZJustificationOption
```
```vb
Public Enumeration YZJustificationOption
```
```cpp
public enum class YZJustificationOption
```
```fsharp
type YZJustificationOption
```

| Member name | Value | Description |
| --- | --- | --- |
| Independent | 1 | Independent justification settings applied to the element ends. |
| Uniform | 0 | Uniform justification settings applied to the element ends. |

#### Reference

Autodesk.Revit.DB.Structure Namespace